Revit 2027 API
Face.GetSurface Method
Returns a copy of this face's surface.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Surface GetSurface()
Public Function GetSurface As Surface
public:
Surface^ GetSurface()
member GetSurface : unit -> Surface
Return Value
Surface
 A copy of this face's surface.
See Also
Reference
Face Class
Autodesk.Revit.DB Namespace